dev.artistly.ai/personal-designs.yml
config:
  # Set from env at runtime (recommended). Fallback to a placeholder for readability.
  target: "{{ $env.BASE_URL }}"
  phases:
    # ~10 VUs steady after a short ramp; tweak as you like
    - duration: 60
      arrivalRate: 15

  # Filter out asset requests from reports (they still load, just not counted)
  http:
    extendedMetrics: true
    skipUnmatchedRequests: true
    match:
      - regexp: ".*/(personal-designs).*"
        as: "main-requests"
    excludeRequests:
      - "**/*.js"
      - "**/*.css"
      - "**/*.png"
      - "**/*.jpg"
      - "**/*.jpeg"
      - "**/*.gif"
      - "**/*.svg"
      - "**/*.woff*"
      - "**/*.ttf"
      - "**/*.eot"
      - "**/*.ico"
      - "**/*.webp"
      - "**/fonts/**"
      - "**/images/**"
      - "**/assets/**"
      - "**/static/**"

  # Playwright (Chromium) is built into Artillery:
  engines:
    playwright:
      aggregateByName: true
      showAllPageMetrics: true
      launchOptions:
        headless: true   # set to false for local debugging

  # Your Playwright code (JS/TS) lives here:
  processor: "./flows.js"

  # Pass values into the test (can come from env via $env.*)
  variables:
    AUTH_URL: "{{ $env.AUTH_URL }}"           # full URL to your GET auth endpoint
    PERSONAL_PATH: "{{ $env.PERSONAL_PATH }}" # e.g. /personal-designs
    ECHO_TIMEOUT_MS: "{{ $env.ECHO_TIMEOUT_MS }}"

scenarios:
  - name: "Auth → /personal-designs (Echo connects)"
    engine: playwright
    testFunction: personalDesignsFlow