dev.artistly.ai/personal-designs.yml
config:
  # Set from env at runtime (recommended). Fallback to a placeholder for readability.
  target: "{{ $env.BASE_URL }}"
  phases:
    # # CDN-OPTIMIZED TEST: Higher loads possible with CDN serving assets
    # # Each Chrome instance = 4 WebSocket connections (optimized default)
    # - duration: 60
    #   arrivalRate: 1
    #   rampTo: 3
    #   name: "cdn-ramp-test"

    # # Sustained high-load test (CDN should eliminate asset bottleneck)
    # # Target: ~300 WebSocket connections (3 Chrome/sec × 30s × 4 connections)
    # - duration: 180
    #   arrivalRate: 3
    #   name: "cdn-sustained-test"

    # Cool down
    - duration: 60
      arrivalRate: 1
      name: "cooldown"

  # Filter out asset requests from reports (they still load, just not counted)
  http:
    extendedMetrics: true
    skipUnmatchedRequests: true
    match:
      - regexp: ".*/(personal-designs).*"
        as: "main-requests"
    excludeRequests:
      - "**/*.js"
      - "**/*.css"
      - "**/*.png"
      - "**/*.jpg"
      - "**/*.jpeg"
      - "**/*.gif"
      - "**/*.svg"
      - "**/*.woff*"
      - "**/*.ttf"
      - "**/*.eot"
      - "**/*.ico"
      - "**/*.webp"
      - "**/fonts/**"
      - "**/images/**"
      - "**/assets/**"
      - "**/static/**"

  # Playwright (Chromium) is built into Artillery:
  engines:
    playwright:
      aggregateByName: true
      showAllPageMetrics: true
      launchOptions:
        headless: true # set to false for local debugging
        args:
          [
            "--no-sandbox",
            "--disable-dev-shm-usage",
            "--disable-gpu",
            "--disable-web-security",
            "--disable-features=TranslateUI",
            "--disable-ipc-flooding-protection",
            "--disable-background-timer-throttling",
            "--disable-renderer-backgrounding",
            "--disable-backgrounding-occluded-windows",
            "--disable-background-networking",
            "--memory-pressure-off",
            "--max_old_space_size=4096",
          ]

  # Your Playwright code (JS/TS) lives here:
  processor: "./flows-optimized.js"

  # Pass values into the test (can come from env via $env.*)
  variables:
    AUTH_URL: "{{ $env.AUTH_URL }}" # full URL to your GET auth endpoint
    PERSONAL_PATH: "{{ $env.PERSONAL_PATH }}" # e.g. /personal-designs
    ECHO_TIMEOUT_MS: "{{ $env.ECHO_TIMEOUT_MS }}"
    CONNECTIONS_PER_INSTANCE: "{{ $env.CONNECTIONS_PER_INSTANCE }}" # Default: 4 connections per Chrome (CDN eliminates asset limits)

scenarios:
  - name: "Auth → /personal-designs (Echo connects)"
    engine: playwright
    testFunction: personalDesignsFlow